ext_b24/Catalogs/СоглашенияСКлиентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СоглашенияСКлиентами</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСоглашенийСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ext_b24/CommonModules/алсавб24_ОбменДаннымиБ24/Ext/Module.bsl
Функция ПолучитьУзелОбменаБ24()
	Возврат ПланыОбмена.алсавб24_ПланОбменаБ24CRM.НайтиПоКоду("Б24_01");
КонецФункции

Процедура ВыполнитьОбменДанными() ЭКСПОРТ 
	
	УзелОбмена = ПолучитьУзелОбменаБ24();
	Если УзелОбмена.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	// Получить все изменения для выгрузки
	Изменения = ПланыОбмена.ВыбратьИзменения(УзелОбмена);
	
	Пока Изменения.Следующий() Цикл
		
		СсылкиНаКонтрагентов = НайтиКонтрагентовПоИзменению(Изменения);
		
		Для Каждого СсылкаНаКонтрагента Из СсылкиНаКонтрагентов Цикл
			
			// Проверяем наличие действующих соглашений у контрагента
			Если ЕстьДействующиеСоглашения(СсылкаНаКонтрагента) Тогда
				
				// Выгружаем контрагента в Б24
				РезультатВыгрузки = Обработки.алсавб24_ВыгрузкаКонтрагентов.ВыгрузитьВБ24(СсылкаНаКонтрагента);
				
				Если РезультатВыгрузки.Успех Тогда
					// Записываем изменение как обработанное
					ПланыОбмена.ЗаписатьИзменения(УзелОбмена, Изменения);
					Прервать; // Если успешно выгрузили для одного контрагента, выходим
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Регистрируем отправку изменений
	ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена);
	
КонецПроцедуры

///
// Найти контрагентов по изменению в плане обмена
// Параметры:
//  Изменение - ВыборкаИзмененийПланаОбмена - изменение из плана обмена
// Возвращаемое значение:
//  Массив - массив ссылок на контрагентов
//
Функция НайтиКонтрагентовПоИзменению(Изменение) Экспорт
	
	СсылкиНаКонтрагентов = Новый Массив;
	
	// Если изменен сам контрагент
	Если Изменение.ТипОбъекта = Метаданные.Справочники.Контрагенты Тогда
		Объект = Изменение.ПолучитьОбъект();
		СсылкиНаКонтрагентов.Добавить(Объект.Ссылка);
		
	ИначеЕсли Изменение.ТипОбъекта = Метаданные.Справочники.Партнеры Тогда
		// Если изменен партнер, ищем связанных контрагентов
		Объект = Изменение.ПолучитьОбъект();
		СсылкиНаКонтрагентов = НайтиКонтрагентовПартнера(Объект.Ссылка);
		
	ИначеЕсли Изменение.ТипОбъекта = Метаданные.Справочники.СоглашенияСКлиентами Тогда
		// Если изменено соглашение, берем контрагента из соглашения
		Объект = Изменение.ПолучитьОбъект();
		Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
			СсылкиНаКонтрагентов.Добавить(Объект.Контрагент);
		КонецЕсли;
		
	ИначеЕсли Изменение.ТипОбъекта = Метаданные.Справочники.БанковскиеСчетаКонтрагентов Тогда
		// Если изменен банковский счет, ищем владельца-контрагента
		Объект = Изменение.ПолучитьОбъект();
		Если ЗначениеЗаполнено(Объект.Владелец) Тогда
			СсылкиНаКонтрагентов.Добавить(Объект.Владелец);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СсылкиНаКонтрагентов;
	
КонецФункции

///
// Найти контрагентов связанных с партнером
// Параметры:
//  Партнер - СправочникСсылка.Партнеры - ссылка на партнера
// Возвращаемое значение:
//  Массив - массив ссылок на контрагентов партнера
//
Функция НайтиКонтрагентовПартнера(Партнер) Экспорт
	
	СсылкиНаКонтрагентов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Партнер = &Партнер
		|	И Контрагенты.ПометкаУдаления = Ложь";
	
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СсылкиНаКонтрагентов.Добавить(Выборка.Контрагент);
		КонецЦикла;
	КонецЕсли;
	
	Возврат СсылкиНаКонтрагентов;
	
КонецФункции

///
// Проверить наличие действующих соглашений у контрагента
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - ссылка на контрагента
// Возвращаемое значение:
//  Булево - Истина если есть действующие соглашения
//
Функция ЕстьДействующиеСоглашения(Контрагент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СоглашенияСКлиентами.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
		|ГДЕ
		|	СоглашенияСКлиентами.Контрагент = &Контрагент
		|	И СоглашенияСКлиентами.Статус = &Статус
		|	И СоглашенияСКлиентами.ПометкаУдаления = Ложь";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыСоглашенийСКлиентами.Действующий);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции
